Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/ieee_802_15_4/mwa_coordinator_dp/mwa_coordinator_dp.c
        App_init();
    }    

    /* Call application task */
    AppThread( param );
}

/*****************************************************************************
* Initialization function for the App Task. This is called during
* initialization and should contain any application specific initialization
* (ie. hardware initialization/setup, table initialization, power up
* notificaiton.
*
* Interface assumptions: None
*
* Return value: None
*
*****************************************************************************/
void App_init( void )
{
    uint32_t i;

    mAppEvent = OSA_EventCreate(TRUE);
    /* The initial application state */
    gState = stateInit;
    /* Reset number of pending packets */
    mcPendingPackets = 0;
    
    for( i=0; i<gMacInstancesCnt_c; i++ )
    {
        /* Prepare input queues.*/
        MSG_InitQueue(&mMlmeNwkInputQueue[i]); 
        MSG_InitQueue(&mMcpsNwkInputQueue[i]);

        /* Initialize the MAC 802.15.4 extended address */
        Mac_SetExtendedAddress( (uint8_t*)&mExtendedAddress[i], i );
    }

    /* register keyboard callback function */
    KBD_Init(App_HandleKeys);
    
    /* Initialize the UART so that we can print out status messages */
    Serial_InitInterface(&interfaceId, APP_SERIAL_INTERFACE_TYPE, APP_SERIAL_INTERFACE_INSTANCE);
    Serial_SetBaudRate(interfaceId, gUARTBaudRate115200_c);
    Serial_SetRxCallBack(interfaceId, UartRxCallBack, NULL);
    
    /*signal app ready*/  
    LED_StartSerialFlash(LED1);
    
    Serial_Print(interfaceId, "\n\rPress any switch on board to start running the application.\n\r", gAllowToBlock_d);  
}

/*****************************************************************************
*Mac Application Task event processor.  This function is called to
* process all events for the task. Events include timers, messages and any
* other user defined events
*
* Interface assumptions: None
*
* Return value: None
*****************************************************************************/

/* The Application Task */
void AppThread(uint32_t argument)
{ 
    osaEventFlags_t ev;
    /* Pointer for storing the messages from MLME, MCPS, and ASP. */
    void *pMsgIn;
    /* Stores the status code returned by some functions. */
    uint8_t ret,i;  

    while(1)
    {
        OSA_EventWait(mAppEvent, osaEventFlagsAll_c, FALSE, osaWaitForever_c, &ev);

        if( !gUseRtos_c && !ev)
        {
            break;
        }
		
        pMsgIn = NULL;

        /* Dequeue the MLME message */
        if( ev & gAppEvtMessageFromMLME_c )
        {
            /* Get the message from MLME */
          for( i=0; i<gMacInstancesCnt_c; i++ )
          {
              if (MSG_Pending(&mMlmeNwkInputQueue[i]))
              {
                  pMsgIn = MSG_DeQueue(&mMlmeNwkInputQueue[i]);
                  mCurrentNwk = i;
                  break;
              }
          }
            
            /* Any time a beacon might arrive. Always handle the beacon frame first */
            if (pMsgIn)
            {               
                ret = App_WaitMsg(pMsgIn, gMlmeBeaconNotifyInd_c);
                if(ret == errorNoError)
                {
                    /* ALWAYS free the beacon frame contained in the beacon notify indication.*/
                    /* ALSO the application can use the beacon payload.*/
                    MSG_Free(((nwkMessage_t *)pMsgIn)->msgData.beaconNotifyInd.pBufferRoot);
                    Serial_Print(interfaceId, "Received an MLME-Beacon Notify Indication\n\r", gAllowToBlock_d);
                }
            }
        }
        
        /* The application state machine */
        switch(gState)
        {
        case stateInit:
            /* Print a welcome message to the UART */
#if gMpmIncluded_d
          Serial_Print(interfaceId,"MyWirelessApp Demo Coordinator Dual PAN application is initialized and ready.\n\r\n\r", gAllowToBlock_d);
#else
          Serial_Print(interfaceId,"MyWirelessApp Demo Coordinator application is initialized and ready.\n\r\n\r", gAllowToBlock_d);
#endif
          /* Goto Energy Detection state. */
          gState = stateScanEdStart;
          OSA_EventSet(mAppEvent, gAppEvtDummyEvent_c);
          break;
          
      case stateScanEdStart:
          /* Start the Energy Detection scan, and goto wait for confirm state. */
          Serial_Print(interfaceId,"Initiating the Energy Detection Scan\n\r", gAllowToBlock_d);

          ret = App_StartScan(gScanModeED_c, 0);
          if(ret == errorNoError)
          {
              gState = stateScanEdWaitConfirm;
          }
          break;
          
      case stateScanEdWaitConfirm:
          /* Stay in this state until the MLME Scan confirm message arrives,
          and has been processed. Then goto Start Coordinator state. */
          if (ev & gAppEvtMessageFromMLME_c)
          {
              if (pMsgIn)
              {
                  ret = App_WaitMsg(pMsgIn, gMlmeScanCnf_c);
                  if(ret == errorNoError)
                  {
                      /* Process the ED scan confirm. The logical
                      channel is selected by this function. */
                      App_HandleScanEdConfirm(pMsgIn);
                      /* Go to the Start Coordinator state */
                      gState = stateStartCoordinator;
                      OSA_EventSet(mAppEvent, gAppEvtStartCoordinator_c);
                  }
              }
          }
          break;
          
          
      case stateStartCoordinator:
          if (ev & gAppEvtStartCoordinator_c)
          {
              /* Start up as a PAN Coordinator on the selected channel. */
              Serial_Print(interfaceId,"\n\rStarting as PAN coordinator on channel(s): ", gAllowToBlock_d);
              for( i=0; i<gMacInstancesCnt_c; i++)
              {
                  Serial_Print(interfaceId,"0x", gAllowToBlock_d);
                  Serial_PrintHex(interfaceId,&maLogicalChannel[i], 1, gPrtHexNoFormat_c);

                  if( (i+1) != gMacInstancesCnt_c )
                      Serial_Print(interfaceId,", ", gAllowToBlock_d);
              }
              
