Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/ieee_802_15_4/mwa_coordinator_dp/mwa_coordinator_dp.c
              Serial_Print(interfaceId,".\n\r", gAllowToBlock_d);

              ret = App_StartCoordinator(0);
              if(ret == errorNoError)
              {
                  /* If the Start request was sent successfully to
                  the MLME, then goto Wait for confirm state. */
                  gState = stateStartCoordinatorWaitConfirm;
              }
          }
          break; 
          
      case stateStartCoordinatorWaitConfirm:
          /* Stay in this state until the Start confirm message
          arrives, and then goto the Listen state. */
          if (ev & gAppEvtMessageFromMLME_c)
          {
              if (pMsgIn)
              {        
                  ret = App_WaitMsg(pMsgIn, gMlmeStartCnf_c);
                  if(ret == errorNoError)
                  {
#if gMpmIncluded_d
                      if (mCurrentNwk == 0)
                      {
                          (void)App_StartCoordinator(1);
                          break;
                      }
#endif
                      for( i=0; i<gMacInstancesCnt_c; i++)
                      {
                          Serial_Print(interfaceId,"Started the coordinator with PAN ID 0x", gAllowToBlock_d);
                          Serial_PrintHex(interfaceId,(uint8_t *)&maPanId[i], 2, gPrtHexNoFormat_c);
                          Serial_Print(interfaceId,", and short address 0x", gAllowToBlock_d);
                          Serial_PrintHex(interfaceId,(uint8_t *)&maShortAddress[i], 2, gPrtHexNoFormat_c);
                          Serial_Print(interfaceId,".\n\r", gAllowToBlock_d);
                      }

                      Serial_Print(interfaceId,"\n\rReady to send and receive data over the UART.\n\r\n\r", gAllowToBlock_d);
                      
                      gState = stateListen;
                      OSA_EventSet(mAppEvent, gAppEvtDummyEvent_c);
                  }
              }
          }
          break; 
          
      case stateListen:
          /* Stay in this state forever. 
          Transmit the data received on UART */
          if (ev & gAppEvtMessageFromMLME_c)
          {
              /* Get the message from MLME */
              if (pMsgIn)
              {      
                  /* Process it */
                  ret = App_HandleMlmeInput(pMsgIn, mCurrentNwk);
                  /* Messages from the MLME must always be freed. */
              }
          }
          
          if (ev & gAppEvtRxFromUart_c)
          {      
              /* get byte from UART */
              App_TransmitUartData();
          }
          break;
      }/* switch(gState) */
      
      if (pMsgIn)
      {
          /* Messages must always be freed. */ 
          MSG_Free(pMsgIn);
          pMsgIn = NULL;
      }
      
      if (ev & gAppEvtMessageFromMCPS_c)
      {      
          /* Get the message from MCPS */
          for( i=0; i<gMacInstancesCnt_c; i++ )
          {
              if( MSG_Pending(&mMcpsNwkInputQueue[i]) )
              {
                  pMsgIn = MSG_DeQueue(&mMcpsNwkInputQueue[i]);
                  mCurrentNwk = i;
                  break;
              }
          }

          if (pMsgIn)
          {
              /* Process it */
              App_HandleMcpsInput(pMsgIn, mCurrentNwk);
              /* Messages from the MCPS must always be freed. */
              MSG_Free(pMsgIn);
              pMsgIn = NULL;
          }
      }  
      
      /* Check for pending messages in the Queue */
      for( i=0; i<gMacInstancesCnt_c; i++ )
      {
          if( MSG_Pending(&mMcpsNwkInputQueue[i]) )
             OSA_EventSet(mAppEvent, gAppEvtMessageFromMCPS_c);
          if( MSG_Pending(&mMlmeNwkInputQueue[i]) )
              OSA_EventSet(mAppEvent, gAppEvtMessageFromMLME_c);
      }

      if( !gUseRtos_c )
      {
          break;
      } 
  }/* while(1) */
}



/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/

/*****************************************************************************
* UartRxCallBack
*
* This callback is triggered when a new byte is received over the UART
*
*****************************************************************************/
static void UartRxCallBack(void *pData) 
{
  uint8_t pressedKey;
  uint16_t count;
  
  if(stateListen == gState){
    OSA_EventSet(mAppEvent, gAppEvtRxFromUart_c);
  }else{
    Serial_GetByteFromRxBuffer(interfaceId, &pressedKey, &count);
  }
}

/******************************************************************************
* The App_StartScan(scanType) function will start the scan process of the
* specified type in the MAC. This is accomplished by allocating a MAC message,
* which is then assigned the desired scan parameters and sent to the MLME
* service access point.
* The function may return either of the following values:
*   errorNoError:          The Scan message was sent successfully.
*   errorInvalidParameter: The MLME service access point rejected the
*                          message due to an invalid parameter.
*   errorAllocFailed:      A message buffer could not be allocated.
*
******************************************************************************/
static uint8_t App_StartScan(macScanType_t scanType, uint8_t appInstance)
{
  mlmeMessage_t *pMsg;
  mlmeScanReq_t *pScanReq;

  Serial_Print(interfaceId,"Sending the MLME-Scan Request message to the MAC...", gAllowToBlock_d);

  /* Allocate a message for the MLME (We should check for NULL). */
  pMsg = MSG_AllocType(mlmeMessage_t);
  if(pMsg != NULL)
  {
    /* This is a MLME-SCAN.req command */
    pMsg->msgType = gMlmeScanReq_c;
    /* Create the Scan request message data. */
    pScanReq = &pMsg->msgData.scanReq;
    /* gScanModeED_c, gScanModeActive_c, gScanModePassive_c, or gScanModeOrphan_c */
    pScanReq->scanType = scanType;
    /* ChannelsToScan */
#ifdef gPHY_802_15_4g_d
    pScanReq->channelPage = gChannelPageId9_c;
    pScanReq->scanChannels[0] = mDefaultValueOfChannel_c;
    for( uint32_t i=1; i < ( sizeof(channelMask_t) / sizeof(uint32_t) ) ; i++ )
    {  
      pScanReq->scanChannels[i] = 0x00;
    }
#else
    pScanReq->scanChannels = mDefaultValueOfChannel_c;
#endif

    /* Duration per channel 0-14 (dc). T[sec] = (16*960*((2^dc)+1))/1000000.
       A scan duration of 3 on 16 channels approximately takes 2 secs. */
    pScanReq->scanDuration = 3;
    /* Don't use security */
    pScanReq->securityLevel = gMacSecurityNone_c;
    
    /* Send the Scan request to the MLME. */
    if( NWK_MLME_SapHandler( pMsg, macInstances[appInstance] ) == gSuccess_c )
    {
      Serial_Print(interfaceId,"Done\n\r", gAllowToBlock_d);
      return errorNoError;
    }
    else
    {
      Serial_Print(interfaceId,"Invalid parameter!\n\r", gAllowToBlock_d);
      return errorInvalidParameter;
    }
  }
  else
  {
    /* Allocation of a message buffer failed. */
    Serial_Print(interfaceId,"Message allocation failed!\n\r", gAllowToBlock_d);
    return errorAllocFailed;
  }
}


