Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/ieee_802_15_4/mwa_coordinator_dp/mwa_coordinator_dp.c
/******************************************************************************
* The App_HandleScanEdConfirm(nwkMessage_t *pMsg) function will handle the
* ED scan confirm message received from the MLME when the ED scan has completed.
* The message contains the ED scan result list. This function will search the
* list in order to select the logical channel with the least energy. The
* selected channel is stored in the global variable called 'maLogicalChannel'.
*
******************************************************************************/
static void App_HandleScanEdConfirm(nwkMessage_t *pMsg)
{  
  uint32_t i, n;
  uint8_t *pEdList;
  uint32_t chMask = mDefaultValueOfChannel_c;
  uint8_t minEnergy;
  uint8_t idx;
#ifndef gPHY_802_15_4g_d
  uint8_t Channel;
#endif
  
  Serial_Print(interfaceId,"Received the MLME-Scan Confirm message from the MAC\n\r", gAllowToBlock_d);
    
  /* Get a pointer to the energy detect results */
  pEdList = pMsg->msgData.scanCnf.resList.pEnergyDetectList;

  for( i=0; i<gMacInstancesCnt_c; i++)
  {
      /* Set the minimum energy to a large value */
      minEnergy = 0xFF;

#ifdef gPHY_802_15_4g_d
      /* Select default channel */
      maLogicalChannel[i] = 0;
      
      /* Search for the channel with least energy */
      for(idx=0, n=0; n<mDefaultMaxChannel_c; n++)
      {
          if( (chMask & (1 << n)) )
          {
              if( pEdList[idx] < minEnergy )
              {
                  minEnergy = pEdList[idx];
                  maLogicalChannel[i] = n;
              }
              idx++;
          }
      }      
#else      
      /* Select default channel */
      maLogicalChannel[i] = 11;
      
      /* Search for the channel with least energy */
      for(idx=0, n=0; n<16; n++)
      {
          /* Channel numbering is 11 to 26 both inclusive */
          Channel = n + 11;
          if( (chMask & (1 << Channel)) )
          {
              if( pEdList[idx] < minEnergy )
              {
                  minEnergy = pEdList[idx];
                  maLogicalChannel[i] = Channel;
              }
              idx++;
          }
      }
#endif /* gPHY_802_15_4g_d */     
      
      chMask &= ~(1 << maLogicalChannel[i]);
  }

  /* Print out the result of the ED scan */
  Serial_Print(interfaceId,"ED scan returned the following results:\n\r  [", gAllowToBlock_d);
#ifdef gPHY_802_15_4g_d
  Serial_PrintHex(interfaceId,pEdList, mDefaultMaxChannel_c, gPrtHexBigEndian_c | gPrtHexSpaces_c);
#else  
  Serial_PrintHex(interfaceId,pEdList, 16, gPrtHexBigEndian_c | gPrtHexSpaces_c);
#endif /* gPHY_802_15_4g_d */
  Serial_Print(interfaceId,"]\n\r\n\r", gAllowToBlock_d);
  
  /* Print out the selected logical channel */
  Serial_Print(interfaceId,"Based on the ED scan the logical channel 0x", gAllowToBlock_d);
  Serial_PrintHex(interfaceId,&maLogicalChannel[0], 1, gPrtHexNoFormat_c);
#if !gMpmIncluded_d
  Serial_Print(interfaceId," was selected\n\r", gAllowToBlock_d);
#else
  Serial_Print(interfaceId," was selected for PAN0,\n\r", gAllowToBlock_d);
  Serial_Print(interfaceId,"and logical cannel 0x", gAllowToBlock_d);
  Serial_PrintHex(interfaceId,&maLogicalChannel[1], 1, 0);
  Serial_Print(interfaceId," was selected for PAN1.\n\r", gAllowToBlock_d);
#endif

  /* The list of detected energies must be freed. */
  MSG_Free(pEdList);
}

/******************************************************************************
* The App_StartScan(scanType) function will start the scan process of the
* specified type in the MAC. This is accomplished by allocating a MAC message,
* which is then assigned the desired scan parameters and sent to the MLME
* service access point. The MAC PIB attributes "macShortAddress", and 
* "macAssociatePermit" are modified.
*
* The function may return either of the following values:
*   errorNoError:          The Scan message was sent successfully.
*   errorInvalidParameter: The MLME service access point rejected the
*                          message due to an invalid parameter.
*   errorAllocFailed:      A message buffer could not be allocated.
*
******************************************************************************/
static uint8_t App_StartCoordinator( uint8_t appInstance )
{
  /* Message for the MLME will be allocated and attached to this pointer */
  mlmeMessage_t *pMsg;
  /* Value that will be written to the MAC PIB */
  uint8_t value;
  /* Pointer which is used for easy access inside the allocated message */
  mlmeStartReq_t *pStartReq;

  Serial_Print(interfaceId,"Sending the MLME-Start Request message to the MAC...", gAllowToBlock_d);
  
  /* Allocate a message for the MLME (We should check for NULL). */
  pMsg = MSG_AllocType(mlmeMessage_t);
  if(pMsg != NULL)
  {
  
    /* Set-up MAC PIB attributes. Please note that Set, Get,
       and Reset messages are not freed by the MLME. */

    /* Initialize the MAC 802.15.4 extended address */
    pMsg->msgType = gMlmeSetReq_c;
    pMsg->msgData.setReq.pibAttribute = gMPibExtendedAddress_c;
    pMsg->msgData.setReq.pibAttributeValue = (uint8_t *)&mExtendedAddress[appInstance];
    (void)NWK_MLME_SapHandler( pMsg, macInstances[appInstance] );
      
    /* We must always set the short address to something
       else than 0xFFFF before starting a PAN. */
    pMsg->msgType = gMlmeSetReq_c;
    pMsg->msgData.setReq.pibAttribute = gMPibShortAddress_c;
    pMsg->msgData.setReq.pibAttributeValue = (uint8_t *)&maShortAddress[appInstance];
    (void)NWK_MLME_SapHandler( pMsg, macInstances[appInstance] );

    /* We must set the Association Permit flag to TRUE 
       in order to allow devices to associate to us. */
    pMsg->msgType = gMlmeSetReq_c;
    pMsg->msgData.setReq.pibAttribute = gMPibAssociationPermit_c;
    value = TRUE;
    pMsg->msgData.setReq.pibAttributeValue = &value;
    (void)NWK_MLME_SapHandler( pMsg, macInstances[appInstance] );

    /* This is a MLME-START.req command */
    pMsg->msgType = gMlmeStartReq_c;

    /* Create the Start request message data. */
    pStartReq = &pMsg->msgData.startReq;
    /* PAN ID - LSB, MSB. The example shows a PAN ID of 0xBEEF. */
    FLib_MemCpy(&pStartReq->panId, (void *)&maPanId[appInstance], 2);
    /* Logical Channel - the default of 11 will be overridden */
    pStartReq->logicalChannel = maLogicalChannel[appInstance];
#ifdef gPHY_802_15_4g_d
    pStartReq->channelPage = gChannelPageId9_c;
#endif
    /* Beacon Order - 0xF = turn off beacons */
    pStartReq->beaconOrder = 0x0F;
    /* Superframe Order - 0xF = turn off beacons */
    pStartReq->superframeOrder = 0x0F;
    /* Be a PAN coordinator */
    pStartReq->panCoordinator = TRUE;
    /* Dont use battery life extension */
    pStartReq->batteryLifeExtension = FALSE;
    /* This is not a Realignment command */
    pStartReq->coordRealignment = FALSE;
    pStartReq->startTime = 0;

    /* Don't use security */
    pStartReq->coordRealignSecurityLevel = gMacSecurityNone_c;
    pStartReq->beaconSecurityLevel       = gMacSecurityNone_c;

    /* Send the Start request to the MLME. */
    if(NWK_MLME_SapHandler( pMsg, macInstances[appInstance] ) != gSuccess_c)
    {
      /* One or more parameters in the Start Request message were invalid. */
      Serial_Print(interfaceId,"Invalid parameter!\n\r", gAllowToBlock_d);
      return errorInvalidParameter;
    }
  }
  else
  {
    /* Allocation of a message buffer failed. */
    Serial_Print(interfaceId,"Message allocation failed!\n\r", gAllowToBlock_d);
    return errorAllocFailed;
  }

  Serial_Print(interfaceId,"Done\n\r", gAllowToBlock_d);
  return errorNoError;
}


