Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/ieee_802_15_4/mwa_coordinator_dp/mwa_coordinator_dp.c
  /* Is it the expected message type? If not then exit with error code */
  if(pMsg->msgType != msgType)
    return errorWrongConfirm;

  /* Found the expected message. Return with success code */
  return errorNoError;
}

/******************************************************************************
* The App_TransmitUartData() function will perform (single/multi buffered)
* data transmissions of data received by the UART. Data could also come from
* other sources such as sensors etc. This is completely determined by the
* application. The constant mDefaultValueOfMaxPendingDataPackets_c determine the maximum
* number of packets pending for transmission in the MAC. A global variable
* is incremented each time a data packet is sent to the MCPS, and decremented
* when the corresponding MCPS-Data Confirm message is received. If the counter
* reaches the defined maximum no more data buffers are allocated until the
* counter is decreased below the maximum number of pending packets.
*
* The function uses the device information, that was stored when the device,
* associated to us, for building an MCPS-Data Request message. The message
* is sent to the MCPS service access point in the MAC.
******************************************************************************/
static void App_TransmitUartData(void)
{
    static uint8_t keysBuffer[mMaxKeysToReceive_c];
    uint16_t i, count;

    /* Count bytes receive over the serial interface */
    Serial_RxBufferByteCount(interfaceId, &count);
    
    if( 0 == count )
    {
        return;
    }
    
    /* Limit data transfer size */
    if( count > mMaxKeysToReceive_c )
    {
        count = mMaxKeysToReceive_c;
    }

    for( i=0; i<gMacInstancesCnt_c; i++ )
    {
        /* Use multi buffering for increased TX performance. It does not really
          have any effect at low UART baud rates, but serves as an
          example of how the throughput may be improved in a real-world
          application where the data rate is of concern. */
        if( (mcPendingPackets < mDefaultValueOfMaxPendingDataPackets_c) && (mpPacket == NULL) ) 
        {
            if( maDeviceShortAddress[i] != 0xFFFF )
            {
                mpPacket = MSG_Alloc(sizeof(nwkToMcpsMessage_t) + count);
            }
            
            if( 0 == i )
            {
                Serial_Read(interfaceId, keysBuffer, count, &count);
            }
        }
        
        if(mpPacket != NULL)
        {
            /* Data is available in the SerialManager's receive buffer. Now create an
            MCPS-Data Request message containing the data. */
            mpPacket->msgType = gMcpsDataReq_c;
            mpPacket->msgData.dataReq.pMsdu = (uint8_t*)(&mpPacket->msgData.dataReq.pMsdu) + 
                                              sizeof(mpPacket->msgData.dataReq.pMsdu);
            FLib_MemCpy(mpPacket->msgData.dataReq.pMsdu, keysBuffer, count);
        
            /* Create the header using device information stored when creating 
            the association response. In this simple example the use of short
            addresses is hardcoded. In a real world application we must be
            flexible, and use the address mode required by the given situation. */
            FLib_MemCpy(&mpPacket->msgData.dataReq.dstAddr, (void*)&maDeviceShortAddress[i], 2);
            FLib_MemCpy(&mpPacket->msgData.dataReq.srcAddr, (void*)&maShortAddress[0], 2);
            FLib_MemCpy(&mpPacket->msgData.dataReq.dstPanId, (void*)&maPanId[i], 2);
            FLib_MemCpy(&mpPacket->msgData.dataReq.srcPanId, (void*)&maPanId[i], 2);
            mpPacket->msgData.dataReq.dstAddrMode = gAddrModeShortAddress_c;
            mpPacket->msgData.dataReq.srcAddrMode = gAddrModeShortAddress_c;
            mpPacket->msgData.dataReq.msduLength = count;
            /* Request MAC level acknowledgement, and 
            indirect transmission of the data packet */
            mpPacket->msgData.dataReq.txOptions = gMacTxOptionsAck_c;
            mpPacket->msgData.dataReq.txOptions |= gMacTxOptionIndirect_c;
            /* Give the data packet a handle. The handle is
            returned in the MCPS-Data Confirm message. */
            mpPacket->msgData.dataReq.msduHandle = mMsduHandle++;
            /* Don't use security */      
            mpPacket->msgData.dataReq.securityLevel = gMacSecurityNone_c;
            
            /* Send the Data Request to the MCPS */
            (void)NWK_MCPS_SapHandler(mpPacket, macInstances[i]);
            /* Prepare for another data buffer */
            mpPacket = NULL;
            mcPendingPackets++;
        }
    }

    /* If the data wasn't send over the air because there are too many pending packets,
    or new data has beed received, try to send it later   */
    Serial_RxBufferByteCount(interfaceId, &count);
    
    if( count )
    {
        OSA_EventSet(mAppEvent, gAppEvtRxFromUart_c);
    }
}


/*****************************************************************************
* Handles all key events for this device.
* Interface assumptions: None
* Return value: None
*****************************************************************************/
static void App_HandleKeys
  (
  uint8_t events  /*IN: Events from keyboard modul  */
  )
{
#if gKBD_KeysCount_c > 0 
    switch ( events ) 
    { 
    case gKBD_EventSW1_c:
    case gKBD_EventSW2_c:
    case gKBD_EventSW3_c:
    case gKBD_EventSW4_c:
    case gKBD_EventLongSW1_c:
    case gKBD_EventLongSW2_c:
    case gKBD_EventLongSW3_c:
    case gKBD_EventLongSW4_c:
        if(gState == stateInit)
          {
          LED_StopFlashingAllLeds();

          OSA_EventSet(mAppEvent, gAppEvtDummyEvent_c);
          }
    break;
    }
#endif
}

/******************************************************************************
* The following functions are called by the MAC to put messages into the
* Application's queue. They need to be defined even if they are not used
* in order to avoid linker errors.
******************************************************************************/
resultType_t MLME_NWK_SapHandler (nwkMessage_t* pMsg, instanceId_t instanceId)
{
  /* Put the incoming MLME message in the applications input queue. */
  MSG_Queue(&mMlmeNwkInputQueue[instanceId], pMsg);
  OSA_EventSet(mAppEvent, gAppEvtMessageFromMLME_c);
  return gSuccess_c;
}

resultType_t MCPS_NWK_SapHandler (mcpsToNwkMessage_t* pMsg, instanceId_t instanceId)
{
  /* Put the incoming MCPS message in the applications input queue. */
  MSG_Queue(&mMcpsNwkInputQueue[instanceId], pMsg);
  OSA_EventSet(mAppEvent, gAppEvtMessageFromMCPS_c);
  return gSuccess_c;
}
